#! -*- coding: utf-8 -*-
import urllib
import json
#案件类型json
ProRemark_list=[{
    "ProID": 1,
    "name": "北京市",
    "ProSort": 1,
    "ProRemark": "直辖市",
    "Court":["北京市高级人民法院",
             '北京市第一中级人民法院',
             '北京市第二中级人民法院',
             '北京铁路运输中级法院'
             ]
}, {
    "ProID": 2,
    "name": "天津市",
    "ProSort": 2,
    "ProRemark": "直辖市",
    "Court":["天津市高级人民法院",
             '天津市第一中级人民法院',
             '天津市第二中级人民法院',
             '天津海事法院'
             ]
}, {
    "ProID": 3,
    "name": "河北省",
    "ProSort": 5,
    "ProRemark": "省份",
    "Court":["河北省高级人民法院",
             '河北省石家庄市中级人民法院',
             '河北省张家口市中级人民法院',
             '河北省承德市中级人民法院',
             '河北省秦皇岛市中级人民法院',
             '河北省唐山市中级人民法院',
             '河北省廊坊市中级人民法院',
             '河北省保定市中级人民法院',
             '河北省沧州市中级人民法院',
             '河北省衡水市中级人民法院',
             '河北省邢台市中级人民法院',
             '河北省邯郸市中级人民法院',
             ]
}, {
    "ProID": 4,
    "name": "山西省",
    "ProSort": 6,
    "ProRemark": "省份",
    "Court":[
        "山西省高级人民法院",
        "山西省太原市中级人民法院",
        "山西省大同市中级人民法院",
        "山西省朔州市中级人民法院",
        "山西省阳泉市中级人民法院",
        "山西省长治市中级人民法院",
        "山西省晋城市中级人民法院",
        "山西省忻州市中级人民法院",
        "山西省晋中市中级人民法院",
        "山西省临汾市中级人民法院",
        "山西省运城市中级人民法院",
        "山西省吕梁市中级人民法院",
        "太原铁路运输中级法院"
    ]
}, {
    "ProID": 5,
    "name": "内蒙古自治区",
    "ProSort": 32,
    "ProRemark": "自治区",
    "Court":[
        "内蒙古自治区高级人民法院",
        "内蒙古自治区呼和浩特市中级人民法院",
        "内蒙古自治区包头市中级人民法院",
        "内蒙古自治区乌海市中级人民法院",
        "内蒙古自治区赤峰市中级人民法院",
        "内蒙古自治区通辽市中级人民法院",
        "内蒙古自治区呼伦贝尔市中级人民法院",
        "内蒙古自治区鄂尔多斯市中级人民法院",
        "内蒙古自治区乌兰察布市中级人民法院",
        "内蒙古自治区巴彦淖尔市中级人民法院",
        "内蒙古自治区兴安盟中级人民法院",
        "内蒙古自治区锡林郭勒盟中级人民法院",
        "内蒙古自治区阿拉善盟中级人民法院",
        "呼和浩特铁路运输中级法院"
    ]
}, {
    "ProID": 6,
    "name": "辽宁省",
    "ProSort": 8,
    "ProRemark": "省份",
    "Court":[
        "辽宁省高级人民法院",
        "辽宁省沈阳市中级人民法院",
        "辽宁省朝阳市中级人民法院",
        "辽宁省阜新市中级人民法院",
        "辽宁省铁岭市中级人民法院",
        "辽宁省抚顺市中级人民法院",
        "辽宁省本溪市中级人民法院",
        "辽宁省辽阳市中级人民法院",
        "辽宁省鞍山市中级人民法院",
        "辽宁省丹东市中级人民法院",
        "辽宁省大连市中级人民法院",
        "辽宁省营口市中级人民法院",
        "辽宁省盘锦市中级人民法院",
        "辽宁省锦州市中级人民法院",
        "辽宁省葫芦岛市中级人民法院",
        "大连海事法院",
        "辽河油田中级法院",
        "沈阳铁路运输中级法院"
    ]
}, {
    "ProID": 7,
    "name": "吉林省",
    "ProSort": 9,
    "ProRemark": "省份",
    "Court":[
        "吉林省高级人民法院",
        "吉林省长春市中级人民法院",
        "吉林省白城市中级人民法院",
        "吉林省松原市中级人民法院",
        "吉林省吉林市中级人民法院",
        "吉林省四平市中级人民法院",
        "吉林省辽源市中级人民法院",
        "吉林省通化市中级人民法院",
        "吉林省白山市中级人民法院",
        "吉林省延边朝鲜族自治州中级人民法院",
        "吉林省白山市中级人民法院分院",
        "吉林省吉林市中级人民法院分院",
        "吉林省延边朝鲜族自治州中级人民法院分院"
    ]
}, {
    "ProID": 8,
    "name": "黑龙江省",
    "ProSort": 10,
    "ProRemark": "省份",
    "Court":[
        "黑龙江省高级人民法院",
        "黑龙江省哈尔滨市中级人民法院",
        "黑龙江省齐齐哈尔市中级人民法院",
        "黑龙江省黑河市中级人民法院",
        "黑龙江省大庆市中级人民法院",
        "黑龙江省伊春市中级人民法院",
        "黑龙江省鹤岗市中级人民法院",
        "黑龙江省佳木斯市中级人民法院",
        "黑龙江省双鸭山市中级人民法院",
        "黑龙江省七台河市中级人民法院",
        "黑龙江省鸡西市中级人民法院",
        "黑龙江省牡丹江市中级人民法院",
        "黑龙江省绥化市中级人民法院",
        "黑龙江省大兴安岭地区中级人民法院",
        "黑龙江省农垦中级法院",
        "黑龙江省林区中级人民法院",
        "哈尔滨铁路运输中级法院"
    ]
}, {
    "ProID": 9,
    "name": "上海市",
    "ProSort": 3,
    "ProRemark": "直辖市",
    "Court":[
        "上海市高级人民法院",
        "上海市第一中级人民法院",
        "上海市第二中级人民法院",
        "上海铁路运输中级法院",
        "上海海事法院"
    ]
}, {
    "ProID": 10,
    "name": "江苏省",
    "ProSort": 11,
    "ProRemark": "省份",
    "Court":[
        "江苏省高级人民法院",
        "江苏省南京市中级人民法院",
        "江苏省徐州市中级人民法院",
        "江苏省连云港市中级人民法院",
        "江苏省宿迁市中级人民法院",
        "江苏省淮安市中级人民法院",
        "江苏省盐城市中级人民法院",
        "江苏省扬州市中级人民法院",
        "江苏省泰州市中级人民法院",
        "江苏省南通市中级人民法院",
        "江苏省镇江市中级人民法院",
        "江苏省常州市中级人民法院",
        "江苏省无锡市中级人民法院",
        "江苏省苏州市中级人民法院"
    ]
}, {
    "ProID": 11,
    "name": "浙江省",
    "ProSort": 12,
    "ProRemark": "省份",
    "Court":[
        "浙江省高级人民法院",
        "浙江省杭州市中级人民法院",
        "浙江省湖州市中级人民法院",
        "浙江省嘉兴市中级人民法院",
        "浙江省舟山市中级人民法院",
        "浙江省宁波市中级人民法院",
        "浙江省绍兴市中级人民法院",
        "浙江省衢州市中级人民法院",
        "浙江省金华市中级人民法院",
        "浙江省台州市中级人民法院",
        "浙江省温州市中级人民法院",
        "浙江省丽水市中级人民法院",
        "宁波海事法院"
    ]

}, {
    "ProID": 12,
    "name": "安徽省",
    "ProSort": 13,
    "ProRemark": "省份",
    "Court":[
        "安徽省高级人民法院",
        "安徽省合肥市中级人民法院",
        "安徽省宿州市中级人民法院",
        "安徽省淮北市中级人民法院",
        "安徽省阜阳市中级人民法院",
        "安徽省亳州市中级人民法院",
        "安徽省蚌埠市中级人民法院",
        "安徽省淮南市中级人民法院",
        "安徽省滁州市中级人民法院",
        "安徽省马鞍山市中级人民法院",
        "安徽省芜湖市中级人民法院",
        "安徽省铜陵市中级人民法院",
        "安徽省安庆市中级人民法院",
        "安徽省黄山市中级人民法院",
        "安徽省六安市中级人民法院",
        "安徽省巢湖市中级人民法院",
        "安徽省池州市中级人民法院",
        "安徽省宣城市中级人民法院"
    ]
}, {
    "ProID": 13,
    "name": "福建省",
    "ProSort": 14,
    "ProRemark": "省份",
    "Court":[
        "福建省高级人民法院",
        "福建省福州市中级人民法院",
        "福建省南平市中级人民法院",
        "福建省三明市中级人民法院",
        "福建省莆田市中级人民法院",
        "福建省泉州市中级人民法院",
        "福建省厦门市中级人民法院",
        "福建省漳州市中级人民法院",
        "福建省龙岩市中级人民法院",
        "福建省宁德市中级人民法院",
        "厦门海事法院"
    ]
}, {
    "ProID": 14,
    "name": "江西省",
    "ProSort": 15,
    "ProRemark": "省份",
    "Court":[
        "江西省高级人民法院",
        "江西省南昌市中级人民法院",
        "江西省九江市中级人民法院",
        "江西省景德镇市中级人民法院",
        "江西省鹰潭市中级人民法院",
        "江西省新余市中级人民法院",
        "江西省萍乡市中级人民法院",
        "江西省赣州市中级人民法院",
        "江西省上饶市中级人民法院",
        "江西省抚州市中级人民法院",
        "江西省宜春市中级人民法院",
        "江西省吉安市中级人民法院",
        "南昌铁路运输中级法院"
    ]
}, {
    "ProID": 15,
    "name": "山东省",
    "ProSort": 16,
    "ProRemark": "省份",
    "Court":[
        "山东省高级人民法院",
        "山东省济南市中级人民法院",
        "山东省聊城市中级人民法院",
        "山东省德州市中级人民法院",
        "山东省东营市中级人民法院",
        "山东省淄博市中级人民法院",
        "山东省潍坊市中级人民法院",
        "山东省烟台市中级人民法院",
        "山东省威海市中级人民法院",
        "山东省青岛市中级人民法院",
        "山东省日照市中级人民法院",
        "山东省临沂市中级人民法院",
        "山东省枣庄市中级人民法院",
        "山东省济宁市中级人民法院",
        "山东省泰安市中级人民法院",
        "山东省莱芜市中级人民法院",
        "山东省滨州市中级人民法院",
        "山东省菏泽市中级人民法院",
        "青岛海事法院",
        "济南铁路运输中级法院"
    ]
}, {
    "ProID": 16,
    "name": "河南省",
    "ProSort": 17,
    "ProRemark": "省份",
    "Court":[
        "河南省高级人民法院",
        "河南省郑州市中级人民法院",
        "河南省三门峡市中级人民法院",
        "河南省洛阳市中级人民法院",
        "河南省焦作市中级人民法院",
        "河南省新乡市中级人民法院",
        "河南省鹤壁市中级人民法院",
        "河南省安阳市中级人民法院",
        "河南省濮阳市中级人民法院",
        "河南省开封市中级人民法院",
        "河南省商丘市中级人民法院",
        "河南省许昌市中级人民法院",
        "河南省漯河市中级人民法院",
        "河南省平顶山市中级人民法院",
        "河南省南阳市中级人民法院",
        "河南省信阳市中级人民法院",
        "河南省周口市中级人民法院",
        "河南省驻马店市中级人民法院",
        "河南省济源中级人民法院",
        "郑州铁路运输中级法院"
    ]
}, {
    "ProID": 17,
    "name": "湖北省",
    "ProSort": 18,
    "ProRemark": "省份",
    "Court":[
        "湖北省高级人民法院",
        "湖北省武汉市中级人民法院",
        "湖北省十堰市中级人民法院",
        "湖北省襄樊市中级人民法院",
        "湖北省荆门市中级人民法院",
        "湖北省孝感市中级人民法院",
        "湖北省黄冈市中级人民法院",
        "湖北省鄂州市中级人民法院",
        "湖北省黄石市中级人民法院",
        "湖北省咸宁市中级人民法院",
        "湖北省荆州市中级人民法院",
        "湖北省宜昌市中级人民法院",
        "湖北省随州市中级人民法院",
        "湖北省汉江中级人民法院",
        "湖北省恩施土家族苗族自治州中级人民法院",
        "武汉海事法院",
        "武汉铁路运输中级法院"
    ]
}, {
    "ProID": 18,
    "name": "湖南省",
    "ProSort": 19,
    "ProRemark": "省份",
    "Court":[
        "湖南省高级人民法院",
        "湖南省长沙市中级人民法院",
        "湖南省张家界市中级人民法院",
        "湖南省常德市中级人民法院",
        "湖南省益阳市中级人民法院",
        "湖南省岳阳市中级人民法院",
        "湖南省株洲市中级人民法院",
        "湖南省湘潭市中级人民法院",
        "湖南省衡阳市中级人民法院",
        "湖南省郴州市中级人民法院",
        "湖南省永州市中级人民法院",
        "湖南省邵阳市中级人民法院",
        "湖南省怀化市中级人民法院",
        "湖南省娄底市中级人民法院",
        "湘西土家族苗族自治州中级人民法院"
    ]
}, {
    "ProID": 19,
    "name": "广东省",
    "ProSort": 20,
    "ProRemark": "省份",
    "Court":[
        "广东省高级人民法院",
        "广东省广州市中级人民法院",
        "广东省清远市中级人民法院",
        "广东省韶关市中级人民法院",
        "广东省河源市中级人民法院",
        "广东省梅州市中级人民法院",
        "广东省潮州市中级人民法院",
        "广东省汕头市中级人民法院",
        "广东省揭阳市中级人民法院",
        "广东省惠州市中级人民法院",
        "广东省东莞市中级人民法院",
        "广东省深圳市中级人民法院",
        "广东省珠海市中级人民法院",
        "广东省中山市中级人民法院",
        "广东省江门市中级人民法院",
        "广东省佛山市中级人民法院",
        "广东省肇庆市中级人民法院",
        "广东省云浮市中级人民法院",
        "广东省阳江市中级人民法院",
        "广东省茂名市中级人民法院",
        "广东省湛江市中级人民法院",
        "广州海事法院",
        "广州铁路运输中级法院"
    ]
}, {
    "ProID": 20,
    "name": "海南省",
    "ProSort": 24,
    "ProRemark": "省份",
    "Court":[
        "海南省高级人民法院",
        "海南省第一中级人民法院",
        "海南省第二中级人民法院",
        "海南省海口市中级人民法院",
        "海南省三亚市中级人民法院",
        "海口海事法院"
    ]

}, {
    "ProID": 21,
    "name": "广西壮族自治区",
    "ProSort": 28,
    "ProRemark": "自治区",
    "Court":[
        "广西壮族自治区高级人民法院",
        "广西壮族自治区南宁市中级人民法院",
        "广西壮族自治区桂林市中级人民法院",
        "广西壮族自治区柳州市中级人民法院",
        "广西壮族自治区梧州市中级人民法院",
        "广西壮族自治区贵港市中级人民法院",
        "广西壮族自治区玉林市中级人民法院",
        "广西壮族自治区钦州市中级人民法院",
        "广西壮族自治区北海市中级人民法院",
        "广西壮族自治区防城港市中级人民法院",
        "广西壮族自治区崇左市中级人民法院",
        "广西壮族自治区百色市中级人民法院",
        "广西壮族自治区河池市中级人民法院",
        "广西壮族自治区来宾市中级人民法院",
        "广西壮族自治区贺州市中级人民法院",
        "北海海事法院",
        "南宁铁路运输中级法院"
    ]
}, {
    "ProID": 22,
    "name": "甘肃省",
    "ProSort": 21,
    "ProRemark": "省份",
    "Court":[
        "甘肃省高级人民法院",
        "甘肃省兰州市中级人民法院",
        "甘肃省嘉峪关市人民法院",
        "甘肃省金昌市中级人民法院",
        "甘肃省白银市中级人民法院",
        "甘肃省武威市中级人民法院",
        "甘肃省酒泉市中级人民法院",
        "甘肃省张掖市中级人民法院",
        "甘肃省庆阳市中级人民法院",
        "甘肃省平凉市中级人民法院",
        "甘肃省定西市中级人民法院",
        "甘肃省陇南市中级人民法院",
        "甘肃省临夏回族自治州中级人民法院",
        "甘肃省甘南藏族自治州中级人民法院",
        "甘肃省甘肃矿区人民法院",
        "甘肃省陇南市中级人民法院分院",
        "兰州铁路运输中级法院"
    ]
}, {
    "ProID": 23,
    "name": "陕西省",
    "ProSort": 27,
    "ProRemark": "省份",
    "Court":[
        "陕西省高级人民法院",
        "陕西省西安市中级人民法院",
        "陕西省延安市中级人民法院",
        "陕西省铜川市中级人民法院",
        "陕西省渭南市中级人民法院",
        "陕西省咸阳市中级人民法院",
        "陕西省宝鸡市中级人民法院",
        "陕西省汉中市中级人民法院",
        "陕西省榆林市中级人民法院",
        "陕西省安康市中级人民法院",
        "陕西省商洛市中级人民法院",
        "西安铁路运输中级法院"
    ]
}, {
    "ProID": 24,
    "name": "新 疆维吾尔自治区",
    "ProSort": 31,
    "ProRemark": "自治区",
    "Court":[
        "新疆维吾尔自治区高级人民法院",
        "新疆维吾尔自治区乌鲁木齐市中级人民法院",
        "新疆维吾尔自治区克拉玛依市中级人民法院",
        "新疆维吾尔自治区喀什地区中级人民法院",
        "新疆维吾尔自治区阿克苏地区中级人民法院",
        "新疆维吾尔自治区和田地区中级人民法院",
        "新疆维吾尔自治区吐鲁番地区中级人民法院",
        "新疆维吾尔自治区哈密地区中级人民法院",
        "新疆维吾尔自治区克孜勒苏柯尔克孜自治州中级人民法院",
        "新疆维吾尔自治区博尔塔拉蒙古自治州中级人民法院",
        "新疆维吾尔自治区昌吉回族自治州中级人民法院",
        "新疆维吾尔自治区巴音郭楞蒙古自治州中级人民法院",
        "新疆维吾尔自治区伊犁哈萨克自治州分院",
        "新疆维吾尔自治区塔城地区中级人民法院",
        "新疆维吾尔自治区阿勒泰地区中级人民法院",
        "乌鲁木齐铁路运输中级法院",
        "新疆维吾尔自治区高级人民法院生产建设兵团分院",
        "农一师中级人民法院",
        "农二师中级人民法院",
        "农三师中级人民法院",
        "农四师中级人民法院",
        "农五师中级人民法院",
        "农六师中级人民法院",
        "农七师中级人民法院",
        "农八师中级人民法院",
        "农九师中级人民法院",
        "农十师中级人民法院",
        "农十二师中级人民法院",
        "农十三师中级人民法院",
        "农十四师中级人民法院"
    ]
}, {
    "ProID": 25,
    "name": "青海省",
    "ProSort": 26,
    "ProRemark": "省份",
    "Court":[
        "青海省高级人民法院",
        "青海省西宁市中级人民法院",
        "青海省海东地区中级人民法院",
        "青海省海北藏族自治州中级人民法院",
        "青海省海南藏族自治州中级人民法院",
        "青海省黄南藏族自治州中级人民法院",
        "青海省果洛藏族自治州中级人民法院",
        "青海省玉树藏族自治州中级人民法院",
        "青海省海西蒙古族藏族自治州中级人民法院"
    ]
}, {
    "ProID": 26,
    "name": "宁夏回族自治区",
    "ProSort": 30,
    "ProRemark": "自治区",
    "Court":[
    "宁夏回族自治区高级人民法院",
    "宁夏回族自治区银川市中级人民法院",
    "宁夏回族自治区石嘴山市中级人民法院",
    "宁夏回族自治区吴忠市中级人民法院",
    "宁夏回族自治区固原市中级人民法院",
    "宁夏回族自治区中卫市中级人民法院"
]
}, {
    "ProID": 27,
    "name": "重庆市",
    "ProSort": 4,
    "ProRemark": "直辖市",
    "Court":[
        "重庆市高级人民法院",
        "重庆市第一中级人民法院",
        "重庆市第二中级人民法院",
        "重庆市第三中级人民法院",
        "重庆市第四中级人民法院",
        "重庆市第五中级人民法院"
    ]
}, {
    "ProID": 28,
    "name": "四川省",
    "ProSort": 22,
    "ProRemark": "省份",
    "Court":[
        "四川省高级人民法院",
        "四川省成都市中级人民法院",
        "四川省广元市中级人民法院",
        "四川省绵阳市中级人民法院",
        "四川省德阳市中级人民法院",
        "四川省南充市中级人民法院",
        "四川省广安市中级人民法院",
        "四川省遂宁市中级人民法院",
        "四川省内江市中级人民法院",
        "四川省乐山市中级人民法院",
        "四川省自贡市中级人民法院",
        "四川省泸州市中级人民法院",
        "四川省宜宾市中级人民法院",
        "四川省攀枝花市中级人民法院",
        "四川省巴中市中级人民法院",
        "四川省达州市中级人民法院",
        "四川省资阳市中级人民法院",
        "四川省眉山市中级人民法院",
        "四川省雅安市中级人民法院",
        "四川省阿坝藏族羌族自治州中级人民法院",
        "四川省甘孜藏族自治州中级人民法院",
        "四川省凉山彝族自治州中级人民法院",
        "成都铁路运输中级法院"
    ]
}, {
    "ProID": 29,
    "name": "贵州省",
    "ProSort": 23,
    "ProRemark": "省份",
    "Court":[
        "贵州省高级人民法院",
        "贵州省贵阳市中级人民法院",
        "贵州省六盘水市中级人民法院",
        "贵州省遵义市中级人民法院",
        "贵州省安顺市中级人民法院",
        "贵州省毕节地区中级人民法院",
        "贵州省铜仁地区中级人民法院",
        "贵州省黔东南苗族侗族自治州中级人民法院",
        "贵州省黔南布依族苗族自治州中级人民法院",
        "贵州省黔西南布依族苗族自治州中级人民法院"
    ]
}, {
    "ProID": 30,
    "name": "云南省",
    "ProSort": 25,
    "ProRemark": "省份",
    "Court":[
        "云南省高级人民法院",
        "云南省昆明市中级人民法院",
        "云南省曲靖市中级人民法院",
        "云南省玉溪市中级人民法院",
        "云南省保山市中级人民法院",
        "云南省昭通市中级人民法院",
        "云南省丽江市中级人民法院",
        "云南省普洱市中级人民法院",
        "云南省临沧市中级人民法院",
        "云南省德宏傣族景颇族自治州中级人民法院",
        "云南省怒江傈僳族自治州中级人民法院",
        "云南省迪庆藏族自治州中级人民法院",
        "云南省大理白族自治州中级人民法院",
        "云南省楚雄彝族自治州中级人民法院",
        "云南省红河哈尼族彝族自治州中级人民法院",
        "云南省文山壮族苗族自治州中级人民法院",
        "云南省西双版纳傣族自治州中级人民法院",
        "昆明铁路运输中级法院"
    ]
}, {
    "ProID": 31,
    "name": "西藏自治区",
    "ProSort": 29,
    "ProRemark": "自治区",
    "Court":[
        "西藏自治区高级人民法院",
        "西藏自治区拉萨市中级人民法院",
        "西藏自治区那曲地区中级人民法院",
        "西藏自治区昌都地区中级人民法院",
        "西藏自治区林芝地区中级人民法院",
        "西藏自治区山南地区中级人民法院",
        "西藏自治区日喀则地区中级人民法院",
        "西藏自治区阿里地区中级人民法院"
    ]
}]
#casetype
CaseType_list=["刑事案件","民事案件","行政案件","赔偿案件","执行案件"]
url_list=[]
for p in ProRemark_list:
    ProRemark=p["name"]
    pro_remark=urllib.quote(ProRemark)
    for caseName in CaseType_list:
        case_name=urllib.quote(caseName)
        for court in p["Court"]:
            court_name=urllib.quote(court)
            url="http://wenshu.court.gov.cn/list/list/?sorttype=1&conditions=searchWord+2+AJLX++"+urllib.quote("案件类型")+":"+case_name+"&conditions=searchWord++CPRQ++" \
                ""+urllib.quote("上传日期")+":2017-07-01%20TO%202017-07-01&conditions=searchWord+"+pro_remark+"+++"+urllib.quote("法院地域")+":"+pro_remark+""\
                "&conditions=searchWord+"+court_name+"+++"+urllib.quote("中级法院")+":"+court_name
            url_list.append(url)
            print "----------------------------------------"
            print url
#将编码过后的url写入文件
# txtName = "/home/dsz/img/wenshuurl.txt"
# f=file(txtName, "a+")
# for url in url_list:
#     new_context=url+ '\n'
#     f.write(new_context)
# f.close()
# print len(url_list)
# with open("wenshuurl.json", "w") as f:
#     json.dump(url_list, f)
#     print("加载入文件完成...")
